vageeshgaonkar1-git/Vehicle_Emission_Monitor_Embedded/stm32/main.c
    uint32_t timeout = 200;
    while (dht22_read_bit() == 1) { delay_us(1); if (--timeout == 0) return HAL_ERROR; }
    timeout = 200;
    while (dht22_read_bit() == 0) { delay_us(1); if (--timeout == 0) return HAL_ERROR; }
    timeout = 200;
    while (dht22_read_bit() == 1) { delay_us(1); if (--timeout == 0) return HAL_ERROR; }

    for (int i = 0; i < 40; i++) {
        timeout = 200;
        while (dht22_read_bit() == 0) { delay_us(1); if (--timeout == 0) return HAL_ERROR; }
        delay_us(35);
        uint8_t bit = dht22_read_bit();
        data[i / 8] = (uint8_t)((data[i / 8] << 1) | bit);
        timeout = 200;
        while (dht22_read_bit() == 1) { delay_us(1); if (--timeout == 0) return HAL_ERROR; }
    }

    uint8_t sum = data[0] + data[1] + data[2] + data[3];
    if (sum != data[4]) return HAL_ERROR;

    *humidity    = ((data[0] << 8) | data[1]) * 0.1f;
    int16_t raw_t = (int16_t)(((data[2] & 0x7F) << 8) | data[3]);
    if (data[2] & 0x80) raw_t = -raw_t;
    *temperature = raw_t * 0.1f;

    return HAL_OK;
}

/* ═══════════════════════════════════════════════════════════════════════════
 *  ADC helper
 * ═══════════════════════════════════════════════════════════════════════════ */
static uint16_t adc_read_channel(uint32_t channel)
{
    ADC_ChannelConfTypeDef cfg = {0};
    cfg.Channel      = channel;
    cfg.Rank         = 1;
    cfg.SamplingTime = ADC_SAMPLETIME_84CYCLES;
    HAL_ADC_ConfigChannel(&hadc1, &cfg);

    HAL_ADC_Start(&hadc1);
    HAL_ADC_PollForConversion(&hadc1, HAL_MAX_DELAY);
    uint16_t val = (uint16_t)HAL_ADC_GetValue(&hadc1);
    HAL_ADC_Stop(&hadc1);
    return val;
}

/* ═══════════════════════════════════════════════════════════════════════════
 *  MQ-7 CO sensor — datasheet-correct R0 calibration + EMA-smoothed PPM
 *
 *  Datasheet clarification:
 *    R0 is defined as the sensor resistance AT 100 ppm CO, not in clean air.
 *    In clean air the ratio Rs/R0 = 27.0 (MQ7_CLEAN_AIR_RATIO), so:
 *        R0 = Rs_clean_air / 27.0
 *    calibrate_mq7_baseline() measures Rs over 50 samples (~5 s), filters out
 *    rail-clamped readings, divides the average by 27.0, and stores the result
 *    as MQ7_R0.
 *
 *  mq7_read_ppm():
 *    Converts a raw 12-bit ADC value to CO ppm using the verified power-law:
 *        ppm = 100 × (Rs / R0)^−1.518
 *    Includes slow upward-drift adaptation (thermal baseline tracking) and an
 *    Exponential Moving Average (α = 0.1) to suppress thermal jitter.
 *
 *  Circuit assumptions:
 *    • MQ-7 VCC = 3.3 V (same as STM32 ADC reference — MQ7_V_SUPPLY)
 *    • Load resistor RL = 10 kΩ (MQ7_RL)
 *    • ADC reads voltage across RL (PA0 → ADC_CHANNEL_0)
 * ═══════════════════════════════════════════════════════════════════════════ */

/**
 * @brief Boot-time Clean Air Baseline Calibration
 *
 * Samples clean-air Rs over ~5 s (50 × 100 ms), filters out saturated/open
 * readings, then divides by MQ7_CLEAN_AIR_RATIO (27.0) to obtain the
 * datasheet-correct R0 at 100 ppm CO.
 */
static void calibrate_mq7_baseline(void)
{
    printf("Calibrating MQ7 baseline in clean air...\n");
    float    rs_sum       = 0.0f;
    uint16_t valid_samples = 0;

    for (int i = 0; i < 50; i++) {
        uint32_t raw_adc = adc_read_channel(ADC_CHANNEL_0);
        float voltage = ((float)raw_adc / 4095.0f) * MQ7_V_SUPPLY;
        if (voltage > 0.05f && voltage < (MQ7_V_SUPPLY - 0.05f)) {
            float rs   = MQ7_RL * (MQ7_V_SUPPLY - voltage) / voltage;
            rs_sum    += rs;
            valid_samples++;
        }
        HAL_Delay(100); /* 50 samples * 100 ms = 5 seconds */
    }

    if (valid_samples > 0) {
        float rs_clean_air = rs_sum / (float)valid_samples;
        /* Correct MQ-7 R0 formula: R0 = Rs_clean / 27.0 */
        MQ7_R0 = rs_clean_air / MQ7_CLEAN_AIR_RATIO;
        if (MQ7_R0 < 0.1f) MQ7_R0 = 1.5f; /* Fallback guard for disconnected sensor */
        printf("MQ7 Calibration Done: Rs_clean = %.2f kOhm -> R0 = %.2f kOhm\n",
               rs_clean_air, MQ7_R0);
    }
}

/**
 * @brief Reads MQ-7 ADC and converts to smoothed PPM with Auto-Baseline Tracking
 *
 * Applies thermal drift compensation (slow upward R0 adaptation) and an
 * Exponential Moving Average (α = 0.1) to suppress thermal jitter.
 */
static float mq7_read_ppm(uint16_t raw_adc)
{
    static float smoothed_ppm = 0.0f;

    float voltage = ((float)raw_adc / 4095.0f) * MQ7_V_SUPPLY;

    if (voltage <= 0.01f || voltage >= (MQ7_V_SUPPLY - 0.01f)) {
        return 0.0f; /* Sensor fault / disconnected */
    }

    /* Calculate current sensor resistance Rs */
    float rs = MQ7_RL * (MQ7_V_SUPPLY - voltage) / voltage;

    /* --- THERMAL DRIFT / AUTO-BASELINE TRACKING ---
     * If the sensor continues to warm up and Rs increases (cleaner air state),
     * dynamically update R0 to prevent ambient PPM creep. */
    float current_r0 = rs / MQ7_CLEAN_AIR_RATIO;
    if (current_r0 > MQ7_R0) {
        MQ7_R0 = (0.99f * MQ7_R0) + (0.01f * current_r0); /* Slow upward drift adaptation */
    }

    /* Calculate Rs/R0 ratio */
    float ratio = rs / MQ7_R0;
    if (ratio < 0.01f) ratio = 0.01f;

    /* Verified MQ-7 Power Law: PPM = 100 * (Rs/R0)^(-1.518) */
    float raw_ppm = 100.0f * powf(ratio, -1.518f);

    /* Safety Clamping */
    if (raw_ppm > 2000.0f) raw_ppm = 2000.0f;
    if (raw_ppm < 0.0f)    raw_ppm = 0.0f;

    /* Exponential Moving Average (EMA) Filter (Alpha = 0.1) */
    smoothed_ppm = (0.1f * raw_ppm) + (0.9f * smoothed_ppm);

    return smoothed_ppm;
}

static float mq135_read_ppm(uint16_t raw_adc, float temperature, float humidity)
{
    const float V_ADC_FS = 3.3f;
    const float V_MAX    = 4095.0f;
    const float V_SUPPLY = 5.0f;
    const float R_LOAD   = 10.0f;

    /* YOUR NEW CALIBRATED BASELINE */
    const float R0       = 5.847f;

    float vout = ((float)raw_adc / V_MAX) * V_ADC_FS;
    if (vout < 0.01f) vout = 0.01f;
    if (vout > V_SUPPLY - 0.01f) vout = V_SUPPLY - 0.01f;

    float rs = R_LOAD * (V_SUPPLY - vout) / vout;

    /* Convert Resistance to PPM using datasheet power curve */
    float ratio = rs / R0;
    float ppm = 116.6f * powf(ratio, -2.769f);

    if (ppm < 0.0f)   ppm = 0.0f;
    if (ppm > 500.0f) ppm = 500.0f;

    return ppm;
}

