vageeshgaonkar1-git/Vehicle_Emission_Monitor_Embedded/stm32/main.c
    /* MQ-7 on PA0 → CO in ppm, MQ-135 on PA1 → NOx/air quality in ppm */
    float co  = mq7_read_ppm(raw_co);
    float nox = mq135_read_ppm(raw_nox, temperature, humidity);

    char timestamp[32];
    if (ds3231_get_timestamp(timestamp, sizeof(timestamp)) != HAL_OK) {
        timestamp[0] = '\0';
    }

    transmit_frame(co, nox, temperature, humidity, is_running, timestamp);
}

/* ═══════════════════════════════════════════════════════════════════════════
 *  System clock — STM32F411CEU6 at 96 MHz
 *  HSE 25 MHz (Black Pill crystal) → PLL → 96 MHz SYSCLK
 *  USB requires a 48 MHz clock: PLLQ = 4 → 96/4 = 48 MHz ✓
 * ═══════════════════════════════════════════════════════════════════════════ */
static void SystemClock_Config(void)
{
    RCC_OscInitTypeDef osc = {0};
    osc.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    osc.HSEState       = RCC_HSE_ON;
    osc.PLL.PLLState   = RCC_PLL_ON;
    osc.PLL.PLLSource  = RCC_PLLSOURCE_HSE;
    osc.PLL.PLLM       = 25;   /* 25 MHz HSE / 25 = 1 MHz VCO input  */
    osc.PLL.PLLN       = 192;  /* × 192 = 192 MHz VCO                */
    osc.PLL.PLLP       = RCC_PLLP_DIV2;  /* 192 / 2 = 96 MHz SYSCLK */
    osc.PLL.PLLQ       = 4;    /* 192 / 4 = 48 MHz USB clock ✓       */
    HAL_RCC_OscConfig(&osc);

    RCC_ClkInitTypeDef clk = {0};
    clk.ClockType      = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
                       | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    clk.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
    clk.AHBCLKDivider  = RCC_SYSCLK_DIV1;   /* HCLK  = 96 MHz */
    clk.APB1CLKDivider = RCC_HCLK_DIV2;     /* PCLK1 = 48 MHz (max for F411) */
    clk.APB2CLKDivider = RCC_HCLK_DIV1;     /* PCLK2 = 96 MHz */
    HAL_RCC_ClockConfig(&clk, FLASH_LATENCY_3);
}
